In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1={
  "name":['harry','rohan','skillf','shubh'],
  "marks":[92,34,24,17],
  "city":['rampur','kolkata','bareilly','antarctica']
 }

In [4]:
dict1

{'name': ['harry', 'rohan', 'skillf', 'shubh'],
 'marks': [92, 34, 24, 17],
 'city': ['rampur', 'kolkata', 'bareilly', 'antarctica']}

In [5]:
df=pd.DataFrame(dict1)
df

     name  marks        city
0   harry     92      rampur
1   rohan     34     kolkata
2  skillf     24    bareilly
3   shubh     17  antarctica

In [14]:
df.to_csv('friends.csv',index=False)

In [8]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [9]:
df.tail(2)

     name  marks        city
2  skillf     24    bareilly
3   shubh     17  antarctica

In [10]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [15]:
e=pd.read_csv('friends.csv')
e

     name  marks        city
0   harry     92      rampur
1   rohan     34     kolkata
2  skillf     24    bareilly
3   shubh     17  antarctica

In [16]:
e

     name  marks        city
0   harry     92      rampur
1   rohan     34     kolkata
2  skillf     24    bareilly
3   shubh     17  antarctica

In [17]:
e['marks'][0]=56

C:\Users\Hp\AppData\Local\Temp\ipykernel_22868\2280790734.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  e['marks'][0]=56

In [18]:
e

     name  marks        city
0   harry     56      rampur
1   rohan     34     kolkata
2  skillf     24    bareilly
3   shubh     17  antarctica

In [20]:
e.index=["first","second","third","fourth"]
e.to_csv('friends.csv')

In [21]:
e

          name  marks        city
first    harry     56      rampur
second   rohan     34     kolkata
third   skillf     24    bareilly
fourth   shubh     17  antarctica